windtunnel_20260324_122623/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-2.5 -1.25 -4.0999999)
    (2.5 -1.25 -4.0999999)
    (2.5 1.25 -4.0999999)
    (-2.5 1.25 -4.0999999)
    (-2.5 -1.25 4.0999999)
    (2.5 -1.25 4.0999999)
    (2.5 1.25 4.0999999)
    (-2.5 1.25 4.0999999)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 25 82) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);
