windtunnel_20260324_122623/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    model.stl
    {
        type triSurfaceMesh;
        name model;
    }
}

castellatedMeshControls
{
    maxLocalCells   250000;
    maxGlobalCells  900000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
    );

    refinementSurfaces
    {
        model
        {
            level (1 2);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    locationInMesh (0 0 -2.46);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    1;
    tolerance        1.5;
    nSolveIter       30;
    nRelaxIter       3;
    nFeatureSnapIter 0;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes    true;
    layers
    {
    }
    expansionRatio   1.0;
    finalLayerThickness 0.3;
    minThickness     0.001;
    nGrow            0;
    featureAngle     60;
    nRelaxIter       0;
    nSmoothSurfaceNormals 0;
    nSmoothNormals   0;
    nSmoothThickness 0;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter       0;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   -1e30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags ( scalarLevels layerSets layerFields );
mergeTolerance 1e-6;
