windtunnel_20260324_122623/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel     kOmegaSST;
    turbulence   on;
    printCoeffs  on;
}
