windtunnel_20260324_122623/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 50);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 50);
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            movingWallVelocity;
        value           uniform (0 0 50);
    }
    top
    {
        type            symmetry;
    }
    sides
    {
        type            symmetry;
    }
    model
    {
        type            noSlip;
    }
}
