windtunnel_20260324_122623/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    top
    {
        type            symmetry;
    }
    sides
    {
        type            symmetry;
    }
    model
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}
